#### Verifying the BGP Configuration

Once the playbook execution is complete, log into each of the switches:

```
(python2) [root@localhost 7.0-3-I6-1]# ssh admin@172.16.30.101
User Access Verification
Password: 

# outout omitted
nx-osv9000-1# 
```

Observe and verify the BGP configuration by issuing the command:

`show running | section bgp`

The output from two of the switches are shown below:

**nx-osv9000-1 (spine)**

``` shell
nx-osv9000-1# show running | section bgp
feature bgp
router bgp 65531
  router-id 192.168.0.1
  address-family ipv4 unicast
    network 172.21.1.0/24
    network 172.21.2.0/24
    network 172.21.3.0/24
    network 172.21.4.0/24
  neighbor 172.20.0.2
    remote-as 65533
    description nx-osv9000-3
    update-source Ethernet1/1
    address-family ipv4 unicast
  neighbor 172.20.0.6
    remote-as 65534
    description nx-osv9000-4
    update-source Ethernet1/2
    address-family ipv4 unicast
  neighbor 172.20.0.18
    remote-as 65532
    description nx-osv9000-2
    update-source Ethernet1/3
    address-family ipv4 unicast
    
    

```


**nx-osv9000v-3(leaf)**

``` shell

nx-osv9000-3# show running-config | section bgp
feature bgp
router bgp 65533
  router-id 192.168.0.3
  address-family ipv4 unicast
    network 172.23.1.0/24
    network 172.23.2.0/24
    network 172.23.3.0/24
    network 172.23.4.0/24
  neighbor 172.20.0.1
    remote-as 65531
    description nx-osv9000-1
    update-source Ethernet1/1
    address-family ipv4 unicast
  neighbor 172.20.0.9
    remote-as 65532
    description nx-osv9000-2
    update-source Ethernet1/2
    address-family ipv4 unicast
nx-osv9000-3# 


```

> Note: The leaf switches have BGP neighbor relationships with the spine switches. Each spine is connected to both leaves and each other.


You can validate this by issuing the `show ip bgp summary` command on **all** the devices.

On a spine device:

``` 
nx-osv9000-1# show ip bgp summary 
BGP summary information for VRF default, address family IPv4 Unicast
BGP router identifier 192.168.0.1, local AS number 65531
BGP table version is 37, IPv4 Unicast config peers 3, capable peers 3
16 network entries and 32 paths using 5504 bytes of memory
BGP attribute entries [8/1248], BGP AS path entries [7/58]
BGP community entries [0/0], BGP clusterlist entries [0/0]

Neighbor        V    AS MsgRcvd MsgSent   TblVer  InQ OutQ Up/Down  State/PfxRcd
172.20.0.2      4 65533      14      23       37    0    0 00:06:35 8         
172.20.0.6      4 65534      13      14       37    0    0 00:05:07 8         
172.20.0.18     4 65532      15      23       37    0    0 00:06:33 12        

```

On a leaf device:

``` 
nx-osv9000-3# show ip bgp summary 
BGP summary information for VRF default, address family IPv4 Unicast
BGP router identifier 192.168.0.3, local AS number 65533
BGP table version is 36, IPv4 Unicast config peers 2, capable peers 2
16 network entries and 28 paths using 4992 bytes of memory
BGP attribute entries [7/1092], BGP AS path entries [6/52]
BGP community entries [0/0], BGP clusterlist entries [0/0]

Neighbor        V    AS MsgRcvd MsgSent   TblVer  InQ OutQ Up/Down  State/PfxRcd
172.20.0.1      4 65531      17      16       36    0    0 00:08:31 12        
172.20.0.9      4 65532      20      17       36    0    0 00:08:29 12        
nx-osv9000-3# 

```

Now that a base BGP configuration is deployed, we're going to use NETCONF to make configuration changes to the devices using the Cisco NXOS YANG model.
