Let's verify that the new prefixes have been added to the BGP configuration, by logging into the devices. Log in to nx-osv9000-1 and nx-osv9000-2 using ssh:


**nx-osv9000-1:**

``` shell
nx-osv9000-1# show running-config section bgp
show running-config | section bgp
feature bgp
router bgp 65531
  router-id 192.168.0.1
  address-family ipv4 unicast
    network 10.101.1.0/24
    network 172.21.1.0/24
    network 172.21.2.0/24
    network 172.21.3.0/24
    network 172.21.4.0/24
  neighbor 172.20.0.2
    remote-as 65533
    description nx-osv9000-3
    update-source Ethernet1/1
    address-family ipv4 unicast
  neighbor 172.20.0.6
    remote-as 65534
...
```

**nx-osv9000-1:**

``` shell
nx-osv9000-2# show running-config section bgp
show running-config | section bgp
feature bgp
router bgp 65532
  router-id 192.168.0.2
  address-family ipv4 unicast
    network 10.102.1.0/24
    network 172.22.1.0/24
    network 172.22.2.0/24
    network 172.22.3.0/24
    network 172.22.4.0/24
  neighbor 172.20.0.10
    remote-as 65533
    description nx-osv9000-3
...
```


To see the advertisements and verify the routes are being exchanged, log onto **nx-osv9000-4** and verify you see the newly advertised prefixes:

Verify you see **10.101.1.0/24** in the BGP table and routing table:

``` 
nx-osv9000-4# show ip bgp 10.101.1.0/24
BGP routing table information for VRF default, address family IPv4 Unicast
BGP routing table entry for 10.101.1.0/24, version 38
Paths: (2 available, best #1)
Flags: (0x00001a) on xmit-list, is in urib, is best urib route, is in HW

  Advertised path-id 1
  Path type: external, path is valid, is best path, no labeled nexthop, in rib
  AS-Path: 65531 , path sourced external to AS
    172.20.0.5 (metric 0) from 172.20.0.5 (192.168.0.1)
      Origin IGP, MED not set, localpref 100, weight 0

  Path type: external, path is valid, not best reason: AS Path, no labeled nexthop
  AS-Path: 65532 65531 , path sourced external to AS
    172.20.0.13 (metric 0) from 172.20.0.13 (192.168.0.2)
      Origin IGP, MED not set, localpref 100, weight 0

  Path-id 1 advertised to peers:
    172.20.0.13    
```

```
nx-osv9000-4# show ip route 10.101.1.0/24
IP Route Table for VRF "default"
'*' denotes best ucast next-hop
'**' denotes best mcast next-hop
'[x/y]' denotes [preference/metric]
'%<string>' in via output denotes VRF <string>

10.101.1.0/24, ubest/mbest: 1/0
    *via 172.20.0.5, [20/0], 00:11:33, bgp-65534, external, tag 65531
nx-osv9000-4# 

```

Verify you see **10.102.1.0/24** in the BGP table and routing table:

``` 
nx-osv9000-4# show ip bgp 10.102.1.0/24
BGP routing table information for VRF default, address family IPv4 Unicast
BGP routing table entry for 10.102.1.0/24, version 40
Paths: (2 available, best #1)
Flags: (0x00001a) on xmit-list, is in urib, is best urib route, is in HW

  Advertised path-id 1
  Path type: external, path is valid, is best path, no labeled nexthop, in rib
  AS-Path: 65532 , path sourced external to AS
    172.20.0.13 (metric 0) from 172.20.0.13 (192.168.0.2)
      Origin IGP, MED not set, localpref 100, weight 0

  Path type: external, path is valid, not best reason: AS Path, no labeled nexthop
  AS-Path: 65531 65532 , path sourced external to AS
    172.20.0.5 (metric 0) from 172.20.0.5 (192.168.0.1)
      Origin IGP, MED not set, localpref 100, weight 0

  Path-id 1 advertised to peers:
    172.20.0.5     
nx-osv9000-4# 

```

```
nx-osv9000-4# show ip route 10.102.1.0/24
IP Route Table for VRF "default"
'*' denotes best ucast next-hop
'**' denotes best mcast next-hop
'[x/y]' denotes [preference/metric]
'%<string>' in via output denotes VRF <string>

10.102.1.0/24, ubest/mbest: 1/0
    *via 172.20.0.13, [20/0], 00:11:38, bgp-65534, external, tag 65532
nx-osv9000-4# 

```

You can also confirm that the newly advertised prefixes are also visible from the **nx-osv9000-3**.

This brings us to the end of part 2. In the next part, we will learn about the OpenConfig YANG model implementation on the Nexus.
